#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tfe_organization.org-omshub will be created
  + resource "tfe_organization" "org-omshub" {
      + collaborator_auth_policy                                = "password"
      + cost_estimation_enabled                                 = (known after apply)
      + email                                                   = "terraform@omshub.org"
      + id                                                      = (known after apply)
      + name                                                    = "omshub"
      + send_passing_statuses_for_untriggered_speculative_plans = (known after apply)
    }

  # tfe_workspace.workspace-core-api will be created
  + resource "tfe_workspace" "workspace-core-api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = (known after apply)
      + file_triggers_enabled         = true
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "core-api"
      + operations                    = (known after apply)
      + organization                  = "omshub"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = (known after apply)
      + terraform_version             = (known after apply)
      + trigger_prefixes              = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @disposedtrolley, Action: `pull_request`*